# Introduction to Machine Learning

In [ ]:
Machine is a branch of AI that focus on building algorithm to train machine to learn from historical data to predict
what may happen in the future

# Type of Machine Learning model

In [ ]:
supervise learning: A type of learning whereby a training is being supervised
    
a.regression: We try to map the input with the output
    
b.classification: Classifying datapoint into groups based on similarities.decisiontress,logistics regression,random forest

unsupervise learning:
    
a.clustering

b.association

In [ ]:
sklearn

In [ ]:
path = C:\Users\user\Desktop\data\data

In [2]:
import pandas as pd
import numpy as np

In [3]:
Startups = pd.read_csv("50_Startups.csv")
Startups.head()

   R&D Spend  Administration  Marketing Spend       State     Profit
0  165349.20       136897.80        471784.10    New York  192261.83
1  162597.70       151377.59        443898.53  California  191792.06
2  153441.51       101145.55        407934.54     Florida  191050.39
3  144372.41       118671.85        383199.62    New York  182901.99
4  142107.34        91391.77        366168.42     Florida  166187.94

In [4]:
Position_Salaries = pd.read_csv("Position_Salaries.csv")
Position_Salaries.head()

            Position  Level  Salary
0   Business Analyst      1   45000
1  Junior Consultant      2   50000
2  Senior Consultant      3   60000
3            Manager      4   80000
4    Country Manager      5  110000

In [5]:
Salary_Data = pd.read_csv("Salary_Data.csv")
Salary_Data.head()

   YearsExperience   Salary
0              1.1  39343.0
1              1.3  46205.0
2              1.5  37731.0
3              2.0  43525.0
4              2.2  39891.0

In [6]:
Social_Network_Ads = pd.read_csv("Social_Network_Ads.csv")
Social_Network_Ads.head()

    User ID  Gender  Age  EstimatedSalary  Purchased
0  15624510    Male   19            19000          0
1  15810944    Male   35            20000          0
2  15668575  Female   26            43000          0
3  15603246  Female   27            57000          0
4  15804002    Male   19            76000          0

# Steps to build supervise learning

 Classification

# Step 1: Load data and perform Data Processing

# Step 2: Split the data into features and target

In [15]:
X = Social_Network_Ads.copy().drop(columns=["User ID"]) # features
y = X.pop("Purchased")         # target

In [16]:
X

     Gender  Age  EstimatedSalary
0      Male   19            19000
1      Male   35            20000
2    Female   26            43000
3    Female   27            57000
4      Male   19            76000
..      ...  ...              ...
395  Female   46            41000
396    Male   51            23000
397  Female   50            20000
398    Male   36            33000
399  Female   49            36000

[400 rows x 3 columns]

In [ ]:
# type of category datatype
# ordinal variable
# nominal variable

# Step 3: Convert all the category variable to dummie data if exists

In [17]:
# to covert the gender to dummy variable
X1=pd.get_dummies(X, columns=['Gender'])

In [18]:
X1

     Age  EstimatedSalary  Gender_Female  Gender_Male
0     19            19000              0            1
1     35            20000              0            1
2     26            43000              1            0
3     27            57000              1            0
4     19            76000              0            1
..   ...              ...            ...          ...
395   46            41000              1            0
396   51            23000              0            1
397   50            20000              1            0
398   36            33000              0            1
399   49            36000              1            0

[400 rows x 4 columns]

In [7]:
Social_Network_Ads

      User ID  Gender  Age  EstimatedSalary  Purchased
0    15624510    Male   19            19000          0
1    15810944    Male   35            20000          0
2    15668575  Female   26            43000          0
3    15603246  Female   27            57000          0
4    15804002    Male   19            76000          0
..        ...     ...  ...              ...        ...
395  15691863  Female   46            41000          1
396  15706071    Male   51            23000          1
397  15654296  Female   50            20000          1
398  15755018    Male   36            33000          0
399  15594041  Female   49            36000          1

[400 rows x 5 columns]

In [19]:
# build decision tree algorithm

from sklearn.tree import DecisionTreeClassifier   # import decisiontree

dt = DecisionTreeClassifier() # create the instance of the decisiontree

model_1 = dt.fit(X1, y)  # building the model

In [20]:
model_1

DecisionTreeClassifier()

In [21]:
X1.columns

Index(['Age', 'EstimatedSalary', 'Gender_Female', 'Gender_Male'], dtype='object')

In [22]:
dic ={"Age":34, "EstimatedSalary":478338, "Gender_Female":1, "Gender_Male":0}
dic_f = pd.DataFrame(dic, index=[0])
dic_f

   Age  EstimatedSalary  Gender_Female  Gender_Male
0   34           478338              1            0

In [23]:
model_1.predict(dic_f)

array([1], dtype=int64)

# Step 4: Split the dataset into train and validation

In [26]:
from sklearn.model_selection import train_test_split
x_train, x_val,y_train,y_val = train_test_split(X1, y, train_size=0.8,random_state=42)

In [34]:
# build decision tree algorithm

from sklearn.tree import DecisionTreeClassifier   # import decisiontree

dt = DecisionTreeClassifier() # create the instance of the decisiontree

model_1 = dt.fit(x_train, y_train)  # building the model

# Step 5:Evaluate the model

In [46]:
y_predict=model_1.predict(x_val)  # evaluating stage

In [47]:
from sklearn.metrics import accuracy_score,classification_report

In [48]:
accuracy_score(y_val,y_predict)

0.85

In [49]:
print(classification_report(y_val,y_predict))

              precision    recall  f1-score   support

           0       0.88      0.88      0.88        52
           1       0.79      0.79      0.79        28

    accuracy                           0.85        80
   macro avg       0.84      0.84      0.84        80
weighted avg       0.85      0.85      0.85        80

In [38]:
# Build a model logistic regression algorithm

from sklearn.linear_model import LogisticRegressionCV

lr = LogisticRegressionCV()
model_2 = lr.fit(x_train, y_train)

In [39]:
y_predict_2=model_2.predict(x_val)  # evaluation stage

In [40]:
accuracy_score(y_val,y_predict_2)

0.6625